amd-ucode
anitui
ark
audacity
awww
base
base-devel
btop
catppuccin-gtk-theme-mocha
cava
cliphist
cmatrix-git
efibootmgr
fastfetch
flatpak
fuse3
git
github-cli
google-chrome
grub
gum
gvfs
hyprland
hyprshot
hyprshutdown
inter-font
jre21-openjdk
kitty
linux
linux-firmware
linux-headers
lxqt-policykit
mako
mpv
nano
neovim
networkmanager
nm-connection-editor
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
nvidia-open-dkms
nvidia-utils
nwg-displays
nwg-look
obs-studio
obsidian
os-prober
pavucontrol
pipewire-pulse
qt5-quickcontrols2
qt6-multimedia-ffmpeg
qt6-virtualkeyboard
reflector
rofi
sddm
sl
sof-firmware
starship
swayidle
tetrio-desktop
thunar
toilet
ttf-jetbrains-mono-nerd
ttf-noto-nerd
ttf-tahoma
tumbler
ufw
vesktop
vscodium
waybar
wireplumber
wl-clipboard
xdg-desktop-portal-hyprland
yay
yay-debug
